<a href="https://colab.research.google.com/github/santhoshkumar-45/2025-26-4125-Santhosh-kumar-AI-B-DS/blob/main/week-2/Data_manipulation.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
# filtering data
import pandas as pd

data = {
    "ID": [101, 102, 103, 104, 105],
    "Name": ["sravani", "ammulya", "yashu", "David", "charan"],
    "Age": [22, 25, 23, 24, 26],
    "Marks": [85, 78, 92, 88, 90]
}

df = pd.DataFrame(data)

print("Original Dataframe:")
print(df)

print("\n Students with marks >85:")
print(df[df["Marks"] > 85])

print("\n student with age <25:")
print(df[df["Age"] < 25])

print(df[(df["Age"] > 23) & (df["Marks"] > 88)])

print(df[df["Marks"] > 90], df["Age"] > 23)

Original Dataframe:
    ID     Name  Age  Marks
0  101  sravani   22     85
1  102  ammulya   25     78
2  103    yashu   23     92
3  104    David   24     88
4  105   charan   26     90

 Students with marks >85:
    ID    Name  Age  Marks
2  103   yashu   23     92
3  104   David   24     88
4  105  charan   26     90

 student with age <25:
    ID     Name  Age  Marks
0  101  sravani   22     85
2  103    yashu   23     92
3  104    David   24     88
    ID    Name  Age  Marks
4  105  charan   26     90
    ID   Name  Age  Marks
2  103  yashu   23     92 0    False
1     True
2    False
3     True
4     True
Name: Age, dtype: bool

In [2]:
# Data Manipulation
import pandas as pd

# create Dataframe
data = {
    "Name": ["A", "B", "C"],
    "Age": [20, 21, 22],
    "Marks": [70, 80, 90]
}

df = pd.DataFrame(data)

print("Original Data:")
print(df)

# Add new column
df["Bonus"] = 5
print("\n After adding Bonus:")
print(df)

# Increase marks
df["Marks"] = df["Marks"] + 2
print("\n After increasing marks")
print(df)

# Change value
df.loc[0, "Age"] = 21
print("\n After changing age of first student:")
print(df)

# Rename column
df.rename(columns={"total": "final"}, inplace=True)
print("\n After renaming total to final:")
print(df)

# Remove column
df.drop("Bonus", axis=1, inplace=True)
print("\n After removing Bonus:")
print(df)

Original Data:
  Name  Age  Marks
0    A   20     70
1    B   21     80
2    C   22     90

 After adding Bonus:
  Name  Age  Marks  Bonus
0    A   20     70      5
1    B   21     80      5
2    C   22     90      5

 After increasing marks
  Name  Age  Marks  Bonus
0    A   20     72      5
1    B   21     82      5
2    C   22     92      5

 After changing age of first student:
  Name  Age  Marks  Bonus
0    A   21     72      5
1    B   21     82      5
2    C   22     92      5

 After renaming total to final:
  Name  Age  Marks  Bonus
0    A   21     72      5
1    B   21     82      5
2    C   22     92      5

 After removing Bonus:
  Name  Age  Marks
0    A   21     72
1    B   21     82
2    C   22     92

In [3]:
# Selection data

import pandas as pd

data = {
    "ID": [101, 102, 103, 104, 105],
    "Name": ["sravani", "ammulya", "yashu", "David", "charan"],
    "Age": [22, 25, 23, 24, 26],
    "Marks": [85, 78, 92, 88, 90]
}

df = pd.DataFrame(data)

print(df)
print(df["Name"])
print(df["Marks"])

df[["Name", "Marks"]]

print("location 0", df.iloc[0])
print("location 1 to 4", df.iloc[1:4])
print("location 1 to 3", df.iloc[0:3, 1:3])

    ID     Name  Age  Marks
0  101  sravani   22     85
1  102  ammulya   25     78
2  103    yashu   23     92
3  104    David   24     88
4  105   charan   26     90
0    sravani
1    ammulya
2      yashu
3      David
4     charan
Name: Name, dtype: object
0    85
1    78
2    92
3    88
4    90
Name: Marks, dtype: int64
location 0 ID           101
Name     sravani
Age           22
Marks         85
Name: 0, dtype: object
location 1 to 4     ID     Name  Age  Marks
1  102  ammulya   25     78
2  103    yashu   23     92
3  104    David   24     88
location 1 to 3       Name  Age
0  sravani   22
1  ammulya   25
2    yashu   23